"""
字符串格式化——format方法(函数)格式化
"""

name = input("请输入您的姓名:")
age = input("请输入您的年龄:")
adress = input("请输入您的地址:")
print("您的姓名是: {}\n您的年龄是: {}\n您的地址是: {}".format(name, age, adress))

# {}是占位符,当里面为空时,默认从左往右选择数据
a = "它说它叫{},它今年{}岁,它宝宝{}个月了!".format("旺财", 2, 3)
print(a)
# 占位符可以填入右边数据的顺序索引来填入对应数据
print("它说它叫{1},它今年{0}岁,它宝宝{2}个月了!".format(2, "旺财", 3))
# 还可以通过关键字来赋值
print("它说它叫{name},它今年{age01}岁,它宝宝{age02}个月了!".format(name="旺财", age01=2, age02=3))
# format格式化函数的复用性
print("它说它叫{name},它今年{age}岁,它宝宝{age}个月了!".format(name="旺财", age=2))  # %无复用性
print("它说它叫{0},它今年{0}岁,它宝宝{0}个月了!".format(2, "旺财", 3))


# format辅助指令
"""
:后面可以附带填充的字符,默认为空格
^、<、> 分别表示居中、左对齐、右对齐,后面附带宽度限定值
使用b、d、o、x分别输出二进制、十进制、八进制、十六进制数字
使用逗号(,)输出金额的千分位分隔符
"""
print('{:>8}'.format('1'))  # 总宽度为8,右对齐,默认空格填充
print('{:0>8}'.format('1'))  # 总宽度为8,右对齐,使用0填充
print('{:a<8}'.format('1'))  # 总宽度为8,左对齐,使用a填充
print('{:.2f}'.format(3.141592653))  # 浮点数精确到小数点后2位
print('{:8.2f}'.format(3.141592653))  # 浮点数精确到小数点后2位,总宽带为8
print('{:<8.2f}'.format(3.141592653))  # 浮点数精确到小数点后2位,总宽带为8,左对齐
print('{:a<8.2f}'.format(3.141592653))  # 浮点数精确到小数点后2位,总宽带为8,左对齐,填充a

print('{0:>8}'.format('3', '5'))  # 也可以通过索引指定输出
print('{1:>8}'.format('3', '5'))

num = 100
print('{:b}'.format(num))  # 1100100
print('{:d}'.format(num))  # 100
print('{:o}'.format(num))  # 144
print('{:x}'.format(num))  # 64
print('{:,}'.format(1234567890))  # 1,234,567,890
