"""
字符串格式化——f-string格式化
"""

name = "WangCai"
age = 2
# f-string用大括号{}表示被替换字段,其中直接填入替换内容
print(f"它说它叫{name}, 它{age}岁, 它宝宝{age}月了!")
# f-string的大括号{}可以填入表达式或调用函数,Python会求出其结果并填入返回的字符串内
print(f"它说它叫{name}, 它{2+2}岁, 它宝宝{age}月了!")
print(f"它说它叫{name.upper()}, 它{4//2}岁, 它宝宝{age}月了!")

# f-string辅助指令
"""
:后面可以附带填充的字符,默认为空格
^、<、> 分别表示居中、左对齐、右对齐,后面附带宽度限定值
使用b、d、o、x 分别输出二进制、十进制、八进制、十六进制数字
使用逗号（,）输出金额的千分位分隔符 """

num = 1
print(f'{num:>8}')  # 总宽度为8,右对齐,默认空格填充
print(f'{num:0>8}')  # 总宽度为8,右对齐,使用0填充
print(f'{num:a<8}')  # 总宽度为8,左对齐,使用a填充
PI = 3.141592653
print(f'{PI:.2f}')  # 浮点数精确到小数点后2位
print(f'{PI:8.2f}')  # 浮点数精确到小数点后2位,总宽带为8
print(f'{PI:<8.2f}')  # 浮点数精确到小数点后2位,总宽带为8,左对齐
print(f'{PI:a<8.2f}')  # 浮点数精确到小数点后2位,总宽带为8,左对齐,填充a
num = 100
print(f'{num:b}')  # 1100100
print(f'{num:d}')  # 100
print(f'{num:o}')  # 144
