"""
索引会降维,切片不会降维
"""

# 一个点:0维——标量
# 一条线:1维(由多个点构成)——向量
# 一个面:2维(由多个线构成)——矩阵
# 一个体:3维(由多个面构成)——张量

# 1,2,3,4每个元素0维
# [1, 2, 3, 4]一个列表认为是1维
# [[1, 2, 3, 4], [5, 6, 7, 8]]多个列表构成的列表认为是2维

list1 = [1, 2, 3, 4]
list2 = [[1, 2, 3, 4],  # 隐式的行拼接
         [5, 6, 7, 8]]
print(list1[2])  # 3;list1是1维,3是0维
print(list2[1])  # [5, 6, 7, 8];list2是2维,[5, 6, 7, 8]是1维
print(list2[1][2])  # 7;list2是2维,7是0维

print(list1[:2])  # [1, 2],还是以列表的形式存在,没有降维
print(list2[:1])  # [[1, 2, 3, 4]],没有降维
print(list1[:1])  # [1];如果索引就是1了
print(list2[:1][:2])
res = list2[:1]  # [[1, 2, 3, 4]]
print(res[:2])  # [[1, 2, 3, 4]]
print(list2[0][:2])  # 索引和切片可以共同使用
