"""
字符串格式化——%格式化符号(传统格式化方法)
"""

# name = input("请输入您的姓名:")
# age = input("请输入您的年龄:")
# adress = input("请输入您的地址:")
# print("您的姓名是:", name, "您的年龄是:", age, "您的地址是:", adress)  # 您的姓名是: 张三 您的年龄是: 18 您的地址是: 人民广场;太分散了
# print("您的姓名是:", name, "您的年龄是:", age, "您的地址是:", adress, sep='')  # 您的姓名是:张三您的年龄是:18您的地址是:人民广场;太集中了
# print("您的姓名是:", name, "  您的年龄是:", age, "  您的地址是:", adress)  # 您的姓名是: 张三   您的年龄是: 18   您的地址是: 人民广场;此时的输出结果舒服一些
# print("您的姓名是:", name, "\n您的年龄是:", age, "\n您的地址是:", adress)  # 换行的输出结果舒服一些

"""以上写法均太麻烦,可以采用字符串格式化"""
# % 格式化符号

name = input("请输入您的姓名:")
age = input("请输入您的年龄:")
adress = input("请输入您的地址:")
print("您的姓名是: %s\n您的年龄是: %s\n您的地址是: %s" % (name, age, adress))
print("您的姓名是: %r\n您的年龄是: %r\n您的地址是: %r" % (name, age, adress))  # 与%s显示方式不同,掌握%s即可

print("它说它叫%s, 今年%d岁, 每天睡%f小时!" % ("旺财", 2, 8.5))  # %f默认精确到小数点后6位
print("它说它叫%s, 擅长%s!" % ("旺财", "汪汪汪"))
print("它说它叫%r, 擅长%r!" % ("旺财", "汪汪汪"))

import datetime
d = datetime.date.today()
print("%s" % d)
print("%r" % d)

print("%c,%c,%c,%c" % (65, 90, 97, 122))
print("%c,%c,%c,%c" % ("A", "Z", "a", "z"))

print("%o" % 20)
print("%x, %X" % (28, 28))

print("123用科学计数法表示为%e" % 123)
print("123用科学计数法表示为%E" % 123)

print("%g" % 1.23456789)  # 保留6位有效数字, 考虑四舍五入
print("%g" % 123456.789)  # 保留6位有效数字, 考虑四舍五入
print("%g" % 1234567.89)  # 保留6位有效数字, 整数部分大于6位则用科学计数法表示
print("%G" % 123456789)  # 大写G, 科学计数法时就用大写E表示


# 附加辅助指令来完善格式化操作
PI = 3.141592653
print("pi1 = %10.3f" % PI)  # 最小显示总宽度为10,保留小数点后3位
print("pi1 = %4.5f" % PI)  # m<n,则m不起作用
print("pi2 = %.*f" % (5, PI))  # 定义精确到小数点后5
print("pi3 = %*f" % (12, PI))  # 定义最小显示宽度为12,%f默认精确到小数点后6位
print("pi4 = %010.3f" % PI)  # 用0填充空白
print("pi5 = %-10.3f" % PI)  # 左对齐,总宽度10个字符,精确到小数点后3位
print("pi6 = %+f" % PI)  # 在正数前面显示正号

print("%o" % 12)
print("%#o" % 12)  # 在八进制数前面显示 '0o'
print("%x" % 24)
print("%#x" % 24)  # 在十六进制前面显示 '0x'
print("%X" % 24)
print("%#X" % 24)  # 在十六进制前面显示 '0X'
